burning-airlines-server/app/views/flights/new.html.erb

SELECT "airplanes".* FROM "airplanes"
---
    <%= f.label :airplane_id, 'Plane' %>
    <%= f.collection_select :airplane_id, Airplane.all, :id, :model, prompt: 'Please choose a plane' %>

SELECT  "airplanes".* FROM "airplanes" WHERE "airplanes"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
SELECT "reservations".* FROM "reservations" WHERE "reservations"."flight_id" = $1  [["flight_id", 83]]
---
      <td><%= flight.airplane.model %></td>
      <td><%= (flight.airplane.rows * flight.airplane.columns) - flight.reservations.length %></td>