burning-airlines-server/app/controllers/flights_controller.rb

SELECT "flights".* FROM "flights"
---
  def new
    @flight = Flight.new
    @flights = Flight.all

SELECT  "flights".* FROM "flights" WHERE "flights"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
---
  def show
    #This method returns the requisite JSON for a flight show page
    flight = Flight.find(params[:id])

SELECT "flights".* FROM "flights" WHERE (origin ILIKE '%Sydney%' AND destination ILIKE '%Melbourne%')
---
  def search
    #This method executes a search and returns correct JSON response

    @from = params[:from]
    @to = params[:to]
    puts '+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++'
    puts params
    puts '+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++'
    #This loops through matching flights to return
    #flights = Flight.where(origin: @from, destination: @to)
    flights = Flight.where('origin ILIKE ? AND destination ILIKE ?', '%' + @from + '%', '%' + @to + '%')
    flights.each do |flight|