burning-airlines-server/app/controllers/reservations_controller.rb

  def show
    reservation = Reservation.find(params[:id])
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = $1 LIMIT $2  [["id", 48], ["LIMIT", 1]]

  def create
    reservation = Reservation.create(
      seatRow: params[:seatRow],
      seatColumn: params[:seatColumn],
      user_id: params[:user_id],
      flight_id: params[:flight_id]
    )
---
INSERT INTO "reservations" ("flight_id", "user_id", "seatRow", "seatColumn", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["flight_id", 43], ["user_id", 17], ["seatRow", "1"], ["seatColumn", "1"], ["created_at", "2018-11-01 01:56:09.539934"], ["updated_at", "2018-11-01 01:56:09.539934"]]