burning-airlines-server/app/controllers/users_controller.rb

  def show
    user = User.find_by(email: params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "bobby_boy@hotmail.com"], ["LIMIT", 1]]